W10D4/reddit_clone/app/views/links/show.html.erb

<ul>
    <% @link.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."link_id" = $1  [["link_id", 1]]