W10D4/reddit_clone/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        comment.user_id = current_user.id
        comment.link_id = params[:link_id]
        comment.save
---
INSERT INTO "comments" ("link_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["link_id", 2], ["user_id", 10], ["body", "cool "], ["created_at", "2019-08-01 21:29:41.665680"], ["updated_at", "2019-08-01 21:29:41.665680"]]