W10D4/reddit_clone/app/controllers/links_controller.rb

INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hi Luke"], ["url", "dsfsvadf"], ["user_id", 2], ["created_at", "2019-08-01 21:27:13.535920"], ["updated_at", "2019-08-01 21:27:13.535920"]]
---
    def create
        @link = Link.new(link_params)
        @link.user_id = current_user.id
        if @link.save